### 1.6. 연산Aggregation 함수

- aggregation 함수: 기본연산을 도와주는 함수의 집합
    - min(): 최소값
    - max(): 최대값
    - sum(): 합계
    - mean(): 평균
    - median(): 중앙값
    - prod(): 곱
    - std(): 표준편차
    - var(): 분산
    - quantile(): 사분위수
    - count(), size(): 그룹 데이터 개수


- groupby('컬럼'): 해당 컬럼의 value값을 기준으로 데이터가 묶여서 출력
- groupby('컬림').agg(['원하는 연산', '들']): 해당 컬럼으로 묶어서 원하는 연산('들')을 해줘!

In [ ]:
# 얼마나 데이터가 들어있나요?
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
Age_0          891
Age_by_10      714
dtype: int64

In [ ]:
# 나이와 요금의 평균은? 
titanic_df[['Age','Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [ ]:
# 연산을 하지 않으면 그냥 DataFrameGroupBy 객체만 할당됨
titanic_groupby = titanic_df.groupby('Pclass')
titanic_groupby

In [ ]:
#Pclass 기준으로 다른 컬럼들 묶어줘!
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10
Pclass,,,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214,216,186
2,184,184,184,184,173,184,184,184,184,16,184,184,173
3,491,491,491,491,355,491,491,491,491,12,491,491,355

1등석의 생존자는 216명, 3등석 생존자는 491명이군요.

In [ ]:
# 그룹바이 후 원하는 컬럼만 가져오기
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId','Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

GroubBy 연산을 여러가지 하고싶을 때는 어떻게 해야할까요? 예컨대 승차 등급별로 나이의 최소, 최대값을 알고싶다면요?

> df.groupby('컬럼')['연산할 컬럼'].agg(['원하는', '연산'])

이런 식으로 agg(aggregate)에 연산하려는 함수의 문자열 리스트를 전달하면 됩니다.

In [ ]:
# Pclass별로 연령의 최소, 최대값을 알려줘!
titanic_df.groupby('Pclass')['Age'].agg(['min', 'max'])

         min   max
Pclass
1       0.92  80.0
2       0.67  70.0
3       0.42  74.0